FemDesign.EntityBase
entity_attribs

FemDesign.EntityBase.EntityCreated
Invoke when an instance is created.
Creates a new guid, adds timestamp and changes action.

FemDesign.EntityBase.EntityModified
Invoke when an instance is modified.
Changes timestamp and action.